####    字符串的使用
from math import pi
#序列操作(索引，分片，乘法，判断成员资格，长度，最大值，最小值)都适用于字符串，但是字符串是不可变的，所以分片赋值是不合法的。
#*************************************格式化字符串********************************
format = "%s is %s years old"
values=("robin","34")
print(format %  values)
#*************************************注意********************************
#注意：只有元组和字典可以格式化一个以上的值，如果使用列表或其他序列代替元组，那么序列将会被解释成为一个值。
print("%s is %s years old" % (["fsadf",56],78))
#*************************************注意********************************
#如果要在格式化字符串中包括百分号，那么必须使用%%
#*************************************其他类型的格式*******************************
format = "PI with three decials: %.3f"
print(format % pi)
#*************************************其他类型的格式*******************************
#如果右操作数是元组或字典的话，其中每一个元素都会被单独格式化，每一个值都需要一个转换说明符。
print("%s %s  %s"  %  (1, 2, 4))

#*************************************简单的转换*******************************
print("%d - %x - %f"  %  (42, 42, pi))
#*************************************find************************************
print("I love china".find("love"))
#*************************************join************************************
print("oo".join("123"))      #
# 1oo2oo3oo

print("oo".join(   ["1","3","5"]    ))
# 1003005
#*************************************lower/upper************************************
print("ABc".lower())
print("abC".upper())
#*************************************replace************************************
print("abc abc china is".replace("abc","888"))
#*************************************split************************************
print("I am robin".split())








