## 列表

########################list函数，把字符串转成列表#######################################
var = list("hell\o")
print(var) # ['h', 'e', 'l', 'l', '\\', 'o']， 注意这里有转义处理
var = list((2,3,4,5))
print(var) # [2, 3, 4, 5], 元组也可以转成列表
########################赋值，删除，分片################
# 可以分片进行赋值，删除，
x = [1,2,3]
x[1] = 9       # 赋值
print(x)

del x[2]       # 删除
print(x)

name = list("perl")
name[2:] = "888888888888"   # 从2开始的赋值
print(name)

name[-3:-1] = "aaaaaaaa"    # 分片赋值
print(name)

name[3:6]= []               #分片删除
print(name)
########################列表的append方法################
list = [1,2,3,4]
list.append(5)            # 末尾追加
print( list)
print(list.count(1))     # 统计元素出现的次数
########################extend：在列表末尾追加另一个序列的多个值################
a=[11,22,33]
b=[44,55,66] # [11, 22, 33, 44, 55, 66]
a.extend(b)   # 和print(a+b)效果一样

a.append(b) # [11, 22, 33, 44, 55, 66, [44, 55, 66]], 注意和上面的区别
print(a)
########################insert： 将对象插入到指定位置#########################
var = [1,2,3,4,5]
var.insert(3,"aa")   # insert方法也可以用赋值来代替

print(var)
########################pop， 弹出元素，并且返回#########################
var=[1,2,3,4,5]
print(var.pop(2))   # 可以指定那个元素POP出来。
print(var)
########################remove: 删除第一个匹配项########################
va=["jim", "robin", "hhh"]
va.remove("jim")
print(va)
########################reverse: 列表元素反向存放########################
x = [1,2,3,4,5]
x.reverse();
print(x)
########################sort: 排序########################
x = [1,6,4,5]
x.sort()           #在列表上直接排序
print(x)
########################sort: 排序， 如果想返回新序列########################
x = [3,7,1,9]
y = x[:]    # 不能用y=x， y=x表示是引用相同的东西
y.sort()
print(y)
########################有参数的sort: ########################
x = ["BB","A","CCC"]
x.sort(key=len, reverse=True)  # 指定键函数，和是否逆序
print(x)

#////////////////////////////////元组：不可变序列//////////////////////////////////////////
x = 1,2,3
y = (1,2,3)
print(x)
print(y)
#////////////////////////////////元组：单个元素的元组中的逗号很重要//////////////////////////////////////////
x = 3 *(40 + 2)
print(x)                    # 126

y= 3 * (40 + 2, )    # 如果是单个元素的话， 一定不能省略逗号
print(y)             # (42, 42, 42)
#////////////////////////////////元组和序列互相转化///////////////////////////////////
var = tuple([1,2,3])      # list  to  元组， 注意list和元组可以互相转化
print(var)
#////////////////////////////////元组基本操作///////////////////////////////////
x = 1,2,3
print(x[0])
print(x[0:2])      # 注意这个是开闭区间
# 元组作用
#(1) 元组可以在映射（和集合的成员）中当做键使用，而列表则不行

#(2)元组作为很多内建函数和方法的返回值存在。

#序列：典型的序列包括列表，字符串和元组。列表是可变的，而元组和字符串是不可变的。分片可以访问序列的一部分






